<?php

return [

    'nav' => [
        'settings' => 'Налаштування',
        'forums' => 'Форуми',
        'tags' => 'Мітки',
    ],

    'settings' => [
        'title' => 'Налаштування форуму',
        'home_message' => 'Повідомлення на головній',
        'webhook' => 'URL Discord Webhook',
        'webhook_info' => 'Повідомлення буде надіслано на цей webhook при додаванні нового повідомлення. Залиште порожнім для вимкнення.',
    ],

    'categories' => [
        'title' => 'Категорії',
        'edit' => 'Редагувати категорію :category',
        'create' => 'Створити категорію',

        'parent' => 'Батьківська категорія',
        'delete_info' => 'Видалення категорії перемістить форуми в батьківську категорію.',
    ],

    'forums' => [
        'title' => 'Форуми',
        'edit' => 'Редагувати форум :forum',
        'create' => 'Створити форум',

        'forum' => 'Форум',
        'category' => 'Категорія',
        'private' => 'Приватний',

        'delete_info' => 'Видалення форуму також видалить усі обговорення в ньому.',
    ],

    'tags' => [
        'title' => 'Мітки',
        'edit' => 'Редагувати мітку :tag',
        'create' => 'Створити мітку',

        'color' => 'Колір',

        'restricted' => 'Обмежена мітка',
        'restricted_info' => 'Тільки користувачі з дозволом можуть додавати цю мітку до обговорень.',

        'delete_info' => 'Видалення мітки також видалить її з усіх обговорень.',
    ],

    'logs' => [
        'title' => 'Логи',

        'actions' => [
            'forum-categories' => [
                'created' => 'Створено категорію форуму #:id',
                'updated' => 'Оновлено категорію форуму #:id',
                'deleted' => 'Видалено категорію форуму #:id',
            ],

            'forum-forums' => [
                'created' => 'Створено форум #:id',
                'updated' => 'Оновлено форум #:id',
                'deleted' => 'Видалено форум #:id',
            ],
        ],
    ],

    'permissions' => [
        'forums' => 'Керувати форумами та категоріями',
        'discussions' => 'Керувати обговореннями форуму (переміщати, редагувати, видаляти, закріплювати, блокувати)',
        'tags' => 'Додавати або видаляти мітки з обговорень форуму',
        'private' => 'Переглядати обговорення інших користувачів у приватних форумах',
        'delete_own_posts' => 'Видаляти власні повідомлення форуму',
        'locked' => 'Створювати обговорення в заблокованому форумі',
        'create_poll' => 'Створювати голосування в обговореннях форуму',
    ],
];
