<?php

return [
    'title' => 'Форум',

    'fields' => [
        'forum' => 'Форум',
        'tags' => 'Теги',
        'editor' => 'Редактор',
    ],

    'actions' => [
        'pin' => 'Закріпити',
        'unpin' => 'Відкріпити',
        'lock' => 'Заблокувати',
        'unlock' => 'Розблокувати',
    ],

    'latest' => [
        'title' => 'Останні повідомлення',
    ],

    'stats' => [
        'title' => 'Статистика',

        'discussions' => 'Обговорення: :count',
        'posts' => 'Повідомлення: :count',
        'users' => 'Користувачі: :count',
    ],

    'online' => [
        'title' => 'Користувачі онлайн',

        'none' => 'Зараз немає користувачів онлайн...',
    ],

    'forums' => [
        'discussions' => ':count обговорення|:count обговорень',

        'locked' => 'Цей форум заблокований.',
    ],

    'discussions' => [
        'title' => 'Обговорення',
        'create' => 'Створити обговорення',
        'edit' => 'Редагувати обговорення',

        'pin' => 'Закріпити це обговорення',
        'lock' => 'Заблокувати це обговорення',

        'respond' => 'Відповісти',
        'views' => ':count перегляд|:count переглядів',

        'locked' => 'Заблокований',
        'pinned' => 'Закріплений',

        'locked_info' => 'Це обговорення заблоковано.',

        'posts' => ':count повідомлення|:count повідомлень',

        'delete' => 'Ви впевнені, що хочете видалити це обговорення?',

        'status' => [
            'created' => 'Обговорення було створено.',
            'updated' => 'Це обговорення було змінено.',
            'deleted' => 'Це обговорення було видалено.',

            'pinned' => 'Це обговорення було закріплено.',
            'unpinned' => 'Це обговорення було відкріплено.',
            'locked' => 'Це обговорення було заблоковано.',
            'unlocked' => 'Це обговорення було розблоковано.',
        ],
    ],

    'posts' => [
        'title' => 'Повідомлення',
        'edit' => 'Редагувати повідомлення',

        'delay' => 'Ви можете створити повідомлення знову через :time.',

        'delete' => 'Ви впевнені, що хочете видалити це повідомлення?',

        'status' => [
            'created' => 'Повідомлення було створено.',
            'updated' => 'Це повідомлення було змінено.',
            'deleted' => 'Це повідомлення було видалено.',
        ],
    ],

    'notifications' => [
        'reply' => ':user відповів у вашому обговоренні :discussion',
        'mention' => ':user згадав вас в :discussion',
    ],

    'polls' => [
        'create' => 'Додати голосування',
        'question' => 'Питання голосування',
        'options' => 'Варіанти відповідей',
        'option' => 'Варіант',
        'multiple_choice' => 'Дозволити множинний вибір',
        'results_before_vote' => 'Показувати результати до голосування',
        'remove_vote' => 'Дозволити повторне голосування',
        'close' => 'Закінчується',
        'close_info' => 'Залиште порожнім для безкінечного голосування.',

        'vote' => 'Голосувати',
        'remove' => 'Змінити голос',
        'votes' => ':count голос|:count голосів',
        'results' => 'Показати результати',
        'back' => 'Повернутися до голосування',
        'closed' => 'Це голосування закінчилося',
        'closes' => 'Закінчується :time',
        'multiple' => 'Ви можете вибрати декілька варіантів.',

        'created' => 'Голосування було створено.',
        'voted' => 'Ваш голос було записано.',
        'vote_removed' => 'Ваш голос було видалено.',
        'deleted' => 'Голосування було видалено.',
        'delete_confirm' => 'Ви впевнені, що хочете видалити це голосування?',
    ],

    'profile' => [
        'likes' => 'Вподобайки',
        'posts' => 'Повідомлення',
        'discussions' => 'Обговорення',

        'information' => 'Інформація',
        'edit' => 'Редагувати профіль',

        'location' => 'Місцезнаходження',
        'website' => 'Веб-сайт',
        'about' => 'Про себе',
        'signature' => 'Підпис',
        'registered' => 'Зареєстрований',
        'last_seen' => 'Остання активність',
        'display_last_seen' => 'Показувати дату останнього відвідування',
    ],
];
